[Killed] ObjectLiteral
main/pages/HelpRequests/HelpRequestEditPage.jsx:31:13
   const objectToAxiosPutParams = (helprequest) => ({
     url: "/api/helprequests",
     method: "PUT",
-    params: {
-      id: helprequest.id,
-    },
+    params: {},
     data: {
       requesterEmail: helprequest.requesterEmail,
killedBy: HelpRequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected {} to deeply equal { id: 17 }
