[Killed] BlockStatement
main/components/Nav/AppNavbar.jsx:7:31
 import { useSystemInfo } from "main/utils/systemInfo";
 import { hasRole } from "main/utils/useCurrentUser";
 
-function AppNavbarLocalhost() {
-  return (
-    <Navbar.Text data-testid="AppNavbarLocalhost" className="me-3">
-      <span data-testid="AppNavbarLocalhost-message1">
-        Running on http://localhost:3000/ with no backend.
-      </span>
-      <br />
-      <span data-testid="AppNavbarLocalhost-message2">
-        You probably want http://localhost:8080 instead.
-      </span>
-    </Navbar.Text>
-  );
-}
+function AppNavbarLocalhost() {}
 
 export default function AppNavbar({
killedBy: AppNavbar tests renders the AppNavbarLocalhost when on http://localhost:3000
statusReason: Unable to find an element by: [data-testid="AppNavbarLocalhost"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-lg navbar-light"
      data-testid="AppNavbar"

[Killed] StringLiteral
main/components/Nav/AppNavbar.jsx:25:16
   currentUser,
   systemInfo,
   doLogout,
-  oauthLogin = "/oauth2/authorization/google",
+  oauthLogin = "",
 }) {
   const systemInfoFromHook = useSystemInfo();
killedBy: AppNavbar tests when oauthlogin undefined, default value is used
statusReason: expect(element).toHaveAttribute("href", "/oauth2/authorization/google") // element.getAttribute("href") === "/oauth2/authorization/google"

Expected the element to have attribute:
  href="/oauth2/authorization/google"
Received:
  href=""

[Killed] LogicalOperator
main/components/Nav/AppNavbar.jsx:28:26
   oauthLogin = "/oauth2/authorization/google",
 }) {
   const systemInfoFromHook = useSystemInfo();
-  const systemInfoData = systemInfo || systemInfoFromHook;
+  const systemInfoData = systemInfo && systemInfoFromHook;
 
   const isLocalhost =
killedBy: AppNavbar tests renders only H2Console link correctly
statusReason: Unable to find an element with the text: H2Console. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-lg navbar-light"
      data-testid="AppNavbar"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.jsx:28:26
   oauthLogin = "/oauth2/authorization/google",
 }) {
   const systemInfoFromHook = useSystemInfo();
-  const systemInfoData = systemInfo || systemInfoFromHook;
+  const systemInfoData = true;
 
   const isLocalhost =
killedBy: AppNavbar tests renders only H2Console link correctly
statusReason: Unable to find an element with the text: H2Console. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-lg navbar-light"
      data-testid="AppNavbar"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.jsx:31:5
   const systemInfoData = systemInfo || systemInfoFromHook;
 
   const isLocalhost =
-    (window.location.hostname === "localhost" ||
-      window.location.hostname === "127.0.0.1") &&
-    window.location.port === "3000";
+    false;
 
   return (
killedBy: AppNavbar tests renders the AppNavbarLocalhost when on http://localhost:3000
statusReason: Unable to find an element by: [data-testid="AppNavbarLocalhost"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-lg navbar-light"
      data-testid="AppNavbar"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.jsx:31:5
   const systemInfoData = systemInfo || systemInfoFromHook;
 
   const isLocalhost =
-    (window.location.hostname === "localhost" ||
-      window.location.hostname === "127.0.0.1") &&
-    window.location.port === "3000";
+    true;
 
   return (
killedBy: AppNavbar tests does NOT render the AppNavbarLocalhost when on localhost:8080
statusReason: Found multiple elements by: [data-testid="/AppNavbarLocalhost/i"]

Here are the matching elements:

Ignored nodes: comments, script, style
<span
  class="me-3 navbar-text"
  data-testid="AppNavbarLocalhost"

[Killed] EqualityOperator
main/components/Nav/AppNavbar.jsx:32:7
 
   const isLocalhost =
     (window.location.hostname === "localhost" ||
-      window.location.hostname === "127.0.0.1") &&
+      window.location.hostname !== "127.0.0.1") &&
     window.location.port === "3000";
 
killedBy: AppNavbar tests renders the AppNavbarLocalhost when on http://127.0.0.1:3000
statusReason: Unable to find an element by: [data-testid="AppNavbarLocalhost"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-lg navbar-light"
      data-testid="AppNavbar"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.jsx:32:7
 
   const isLocalhost =
     (window.location.hostname === "localhost" ||
-      window.location.hostname === "127.0.0.1") &&
+      false) &&
     window.location.port === "3000";
 
killedBy: AppNavbar tests renders the AppNavbarLocalhost when on http://127.0.0.1:3000
statusReason: Unable to find an element by: [data-testid="AppNavbarLocalhost"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-lg navbar-light"
      data-testid="AppNavbar"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.jsx:33:5
   const isLocalhost =
     (window.location.hostname === "localhost" ||
       window.location.hostname === "127.0.0.1") &&
-    window.location.port === "3000";
+    true;
 
   return (
killedBy: AppNavbar tests does NOT render the AppNavbarLocalhost when on localhost:8080
statusReason: Found multiple elements by: [data-testid="/AppNavbarLocalhost/i"]

Here are the matching elements:

Ignored nodes: comments, script, style
<span
  class="me-3 navbar-text"
  data-testid="AppNavbarLocalhost"

[Killed] EqualityOperator
main/components/Nav/AppNavbar.jsx:33:5
   const isLocalhost =
     (window.location.hostname === "localhost" ||
       window.location.hostname === "127.0.0.1") &&
-    window.location.port === "3000";
+    window.location.port !== "3000";
 
   return (
killedBy: AppNavbar tests renders the AppNavbarLocalhost when on http://localhost:3000
statusReason: Unable to find an element by: [data-testid="AppNavbarLocalhost"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-lg navbar-light"
      data-testid="AppNavbar"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.jsx:46:14
 
         <Navbar.Collapse id="basic-navbar-nav">
           <Nav className="me-auto">
-            {currentUser && currentUser.loggedIn && (
+            {true && (
               <>
                 <Nav.Link as={Link} to="/ucsbdates">
killedBy: AppNavbar tests Restaurant and UCSBDates links do NOT show when not logged in
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <a
  class="nav-link"
  data-discover="true"
  href="/restaurants"
>
  Restaurants

[Killed] LogicalOperator
main/components/Nav/AppNavbar.jsx:46:14
 
         <Navbar.Collapse id="basic-navbar-nav">
           <Nav className="me-auto">
-            {currentUser && currentUser.loggedIn && (
+            {currentUser || currentUser.loggedIn && (
               <>
                 <Nav.Link as={Link} to="/ucsbdates">
killedBy: AppNavbar tests Restaurant and UCSBDates links do NOT show when not logged in
statusReason: Cannot read properties of null (reading 'loggedIn')

[Killed] OptionalChaining
main/components/Nav/AppNavbar.jsx:92:18
                   </NavDropdown>
                 )}
 
-                {systemInfoData?.springH2ConsoleEnabled && (
+                {systemInfoData.springH2ConsoleEnabled && (
                   <Nav.Link href="/h2-console">H2Console</Nav.Link>
                 )}
killedBy: AppNavbar tests renders correctly for regular logged in user
statusReason: Cannot read properties of undefined (reading 'springH2ConsoleEnabled')

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.jsx:92:18
                   </NavDropdown>
                 )}
 
-                {systemInfoData?.springH2ConsoleEnabled && (
-                  <Nav.Link href="/h2-console">H2Console</Nav.Link>
-                )}
+                {false}
 
                 {systemInfoData?.showSwaggerUILink && (
killedBy: AppNavbar tests renders only H2Console link correctly
statusReason: Unable to find an element with the text: H2Console. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-lg navbar-light"
      data-testid="AppNavbar"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.jsx:96:18
                   <Nav.Link href="/h2-console">H2Console</Nav.Link>
                 )}
 
-                {systemInfoData?.showSwaggerUILink && (
-                  <Nav.Link href="/swagger-ui/index.html">Swagger</Nav.Link>
-                )}
+                {false}
               </>
             )}
killedBy: AppNavbar tests renders only Swagger link correctly
statusReason: Unable to find an element with the text: Swagger. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-lg navbar-light"
      data-testid="AppNavbar"

[Killed] OptionalChaining
main/components/Nav/AppNavbar.jsx:96:18
                   <Nav.Link href="/h2-console">H2Console</Nav.Link>
                 )}
 
-                {systemInfoData?.showSwaggerUILink && (
+                {systemInfoData.showSwaggerUILink && (
                   <Nav.Link href="/swagger-ui/index.html">Swagger</Nav.Link>
                 )}
killedBy: AppNavbar tests renders correctly for regular logged in user
statusReason: Cannot read properties of undefined (reading 'showSwaggerUILink')

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.jsx:104:14
           </Nav>
 
           <Nav className="ml-auto">
-            {isLocalhost && <AppNavbarLocalhost />}
+            {true}
 
             {currentUser && currentUser.loggedIn ? (
killedBy: AppNavbar tests renders the AppNavbarLocalhost when on http://localhost:3000
statusReason: Unable to find an element by: [data-testid="AppNavbarLocalhost"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-lg navbar-light"
      data-testid="AppNavbar"

[Killed] LogicalOperator
main/components/Nav/AppNavbar.jsx:104:14
           </Nav>
 
           <Nav className="ml-auto">
-            {isLocalhost && <AppNavbarLocalhost />}
+            {isLocalhost || <AppNavbarLocalhost />}
 
             {currentUser && currentUser.loggedIn ? (
killedBy: AppNavbar tests renders the AppNavbarLocalhost when on http://localhost:3000
statusReason: Unable to find an element by: [data-testid="AppNavbarLocalhost"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-lg navbar-light"
      data-testid="AppNavbar"
