[Killed] StringLiteral
main/components/HelpRequests/HelpRequestTable.jsx:44:20
     },
     {
       header: "Requester Email",
-      accessorKey: "requesterEmail", // accessor is the "key" in the data
+      accessorKey: "", // accessor is the "key" in the data
     },
     {
killedBy: HelpRequestTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="HelpRequestTable-cell-row-0-col-requesterEmail"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="HelpRequestTable"

[Killed] ObjectLiteral
main/components/HelpRequests/HelpRequestTable.jsx:54:5
       header: "Table or Breakout Room",
       accessorKey: "tableOrBreakoutRoom",
     },
-    {
-      header: "Request Time (iso format)",
-      accessorKey: "requestTime",
-    },
+    {},
     {
       header: "Explanation",
killedBy: HelpRequestTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header
