[Killed] MethodExpression
main/components/MenuItemReviews/MenuItemReviewForm.jsx:13:23
   const defaultValues = initialContents
     ? {
         ...initialContents,
-        dateReviewed: initialContents.dateReviewed?.slice(0, 16),
+        dateReviewed: initialContents.dateReviewed,
       }
     : {};
killedBy: MenuItemReviewsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expect(element).toHaveValue(2026-05-04T15:10)

Expected the element to have value:
  2026-05-04T15:10
Received:
  2026-05-04T15:10:10.000

[Killed] OptionalChaining
main/components/MenuItemReviews/MenuItemReviewForm.jsx:13:23
   const defaultValues = initialContents
     ? {
         ...initialContents,
-        dateReviewed: initialContents.dateReviewed?.slice(0, 16),
+        dateReviewed: initialContents.dateReviewed.slice(0, 16),
       }
     : {};
killedBy: MenuItemReviewForm tests renders correctly when initialContents has no dateReviewed
statusReason: Cannot read properties of undefined (reading 'slice')

[Killed] ConditionalExpression
main/components/MenuItemReviews/MenuItemReviewForm.jsx:40:8
 
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
-      {initialContents && (
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="id">Id</Form.Label>
-          <Form.Control
-            data-testid={testIdPrefix + "-id"}
-            id="id"
-            type="number"
-            {...register("id")}
-            disabled
-          />
-        </Form.Group>
-      )}
+      {false}
 
       <Form.Group className="mb-3">
killedBy: MenuItemReviewsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="MenuItemReviewForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/components/MenuItemReviews/MenuItemReviewForm.jsx:40:8
 
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
-      {initialContents && (
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="id">Id</Form.Label>
-          <Form.Control
-            data-testid={testIdPrefix + "-id"}
-            id="id"
-            type="number"
-            {...register("id")}
-            disabled
-          />
-        </Form.Group>
-      )}
+      {true}
 
       <Form.Group className="mb-3">
killedBy: MenuItemReviewsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="MenuItemReviewForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewForm.jsx:47:26
             data-testid={testIdPrefix + "-id"}
             id="id"
             type="number"
-            {...register("id")}
+            {...register("")}
             disabled
           />
killedBy: MenuItemReviewsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="MenuItemReviewForm-id"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
