[Killed] BlockStatement
main/pages/MenuItemReviews/MenuItemReviewsCreatePage.jsx:20:41
     },
   });
 
-  const onSuccess = (menuItemReview) => {
-    toast(
-      `New MenuItemReview Created - id: ${menuItemReview.id} itemId: ${menuItemReview.itemId}`,
-    );
-  };
+  const onSuccess = (menuItemReview) => {};
 
   const mutation = useBackendMutation(
killedBy: MenuItemReviewsCreatePage tests on submit, makes request to backend, and redirects to /menuItemReviews
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0
