[Killed] StringLiteral
main/pages/MenuItemReviews/MenuItemReviewsEditPage.jsx:45:7
 
   const onSuccess = (menuItemReview) => {
     toast(
-      `MenuItemReview Updated - id: ${menuItemReview.id} itemId: ${menuItemReview.itemId}`,
+      ``,
     );
   };
killedBy: MenuItemReviewsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "MenuItemReview Updated - id: 17 itemId: 3",

[Killed] LogicalOperator
main/pages/MenuItemReviews/MenuItemReviewsEditPage.jsx:70:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit MenuItemReview</h1>
-        {menuItemReview && (
-          <MenuItemReviewForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={menuItemReview}
-          />
-        )}
+        {menuItemReview || <MenuItemReviewForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={menuItemReview} />}
       </div>
     </BasicLayout>
killedBy: MenuItemReviewsEditPage tests when the backend doesn't return data renders header but form is not present
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <input
  class="form-control"
  data-testid="MenuItemReviewForm-itemId"
  id="itemId"
  name="itemId"
  type="number"
