[Killed] BlockStatement
main/pages/MenuItemReviews/MenuItemReviewsIndexPage.jsx:24:30
     [],
   );
 
-  const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-      return (
-        <Button
-          variant="primary"
-          href="/menuItemReviews/create"
-          style={{ float: "right" }}
-        >
-          Create MenuItemReview
-        </Button>
-      );
-    }
-  };
+  const createButton = () => {};
 
   return (
killedBy: MenuItemReviewsIndexPage tests Renders with Create Button for admin user
statusReason: Unable to find an element with the text: /Create MenuItemReview/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/MenuItemReviews/MenuItemReviewsIndexPage.jsx:30:27
         <Button
           variant="primary"
           href="/menuItemReviews/create"
-          style={{ float: "right" }}
+          style={{ float: "" }}
         >
           Create MenuItemReview
killedBy: MenuItemReviewsIndexPage tests Renders with Create Button for admin user
statusReason: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null
