[Killed] ObjectLiteral
main/components/UCSBOrganizations/UCSBOrganizationForm.jsx:14:15
     register,
     formState: { errors },
     handleSubmit,
-  } = useForm({
-    defaultValues: initialContents || {},
-  });
+  } = useForm({});
 
   const navigate = useNavigate();
killedBy: UCSBOrganizationForm tests renders with initialContents
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
main/components/UCSBOrganizations/UCSBOrganizationForm.jsx:23:8
 
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
-      {initialContents && (
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="orgCode">Organization Code</Form.Label>
-          <Form.Control
-            data-testid={testIdPrefix + "-orgCode"}
-            id="orgCode"
-            type="text"
-            {...register("orgCode")}
-            disabled
-          />
-        </Form.Group>
-      )}
+      {initialContents || <Form.Group className="mb-3">
+          <Form.Label htmlFor="orgCode">Organization Code</Form.Label>
+          <Form.Control data-testid={testIdPrefix + "-orgCode"} id="orgCode" type="text" {...register("orgCode")} disabled />
+        </Form.Group>}
 
       <Form.Group className="mb-3">
killedBy: UCSBOrganizationForm tests does not show orgCode when no initialContents
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <input
  class="form-control"
  data-testid="UCSBOrganizationForm-orgCode"
  disabled=""
  id="orgCode"
  name="orgCode"

[Killed] ConditionalExpression
main/components/UCSBOrganizations/UCSBOrganizationForm.jsx:23:8
 
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
-      {initialContents && (
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="orgCode">Organization Code</Form.Label>
-          <Form.Control
-            data-testid={testIdPrefix + "-orgCode"}
-            id="orgCode"
-            type="text"
-            {...register("orgCode")}
-            disabled
-          />
-        </Form.Group>
-      )}
+      {true}
 
       <Form.Group className="mb-3">
killedBy: UCSBOrganizationForm tests renders correctly when passing in initialContents
statusReason: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
