[Killed] ArrayDeclaration
main/components/UCSBOrganizations/UCSBOrganizationTable.jsx:37:19
     deleteMutation.mutate(cell);
   };
 
-  const columns = [
-    {
-      header: "Organization Code",
-      accessorKey: "orgCode", // accessor is the "key" in the data
-    },
-
-    {
-      header: "Organization Translation",
-      accessorKey: "orgTranslation",
-    },
-    {
-      header: "Organization Translation Short",
-      accessorKey: "orgTranslationShort",
-    },
-    {
-      header: "Inactive",
-      accessorKey: "inactive",
-    },
-  ];
+  const columns = [];
 
   if (hasRole(currentUser, "ROLE_ADMIN")) {
killedBy: UCSBOrganizationTable tests renders empty table correctly
statusReason: Unable to find an element with the text: Organization Code. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UCSBOrganizationTable"

[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationTable.jsx:39:15
 
   const columns = [
     {
-      header: "Organization Code",
+      header: "",
       accessorKey: "orgCode", // accessor is the "key" in the data
     },
killedBy: UCSBOrganizationTable tests renders empty table correctly
statusReason: Unable to find an element with the text: Organization Code. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UCSBOrganizationTable"

[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationTable.jsx:40:20
   const columns = [
     {
       header: "Organization Code",
-      accessorKey: "orgCode", // accessor is the "key" in the data
+      accessorKey: "", // accessor is the "key" in the data
     },
 
killedBy: UCSBOrganizationTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="UCSBOrganizationTable-cell-row-0-col-orgCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UCSBOrganizationTable"

[Killed] ObjectLiteral
main/components/UCSBOrganizations/UCSBOrganizationTable.jsx:47:5
       header: "Organization Translation",
       accessorKey: "orgTranslation",
     },
-    {
-      header: "Organization Translation Short",
-      accessorKey: "orgTranslationShort",
-    },
+    {},
     {
       header: "Inactive",
killedBy: UCSBOrganizationTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationTable.jsx:49:20
     },
     {
       header: "Organization Translation Short",
-      accessorKey: "orgTranslationShort",
+      accessorKey: "",
     },
     {
killedBy: UCSBOrganizationTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="UCSBOrganizationTable-cell-row-0-col-orgTranslationShort"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UCSBOrganizationTable"
